Repository: eurolinux-enterprise-linux-sources/system-config-services-docs
Catalog: src/doc/*/*.po
Languages: bn_in, nl

source: Controlling Access to Services
bn_in: পরিসেবা ব্যবহারের অধিকার নিয়ন্ত্রণ ব্যবস্থা
nl: Controle van toegang tot voorzieningen

source: Maintaining security on your system is extremely important, and one approach for this task is to manage access to system services carefully. Your system may need to provide open access to particular services (for example, <command>httpd</command> if you are running a Web server). However, if you do not need to provide a service, you should turn it off to minimize your exposure to possible bug exploits.
bn_in: সিস্টেমের নিরাপত্তা বজায় রাখা অত্যন্ত গুরুত্বপূর্ণ এবং সিস্টেমের বিভিন্ন পরিসেবা ব্যবহারের অধিক নিয়ন্ত্রণের সাহায্যে কিছু মাত্রায় এটি করা সম্ভব হবে। কিছু সুনির্দিষ্ট পরিসেবার জন্য আপনার সিস্টেমে ব্যবহারাধিকার প্রদান করার প্রয়োজন দেখা দিতে পারে (যেমন, ওয়েব-সার্ভার ব্যবহারকালে<command>httpd</command> পরিসেবার ব্যবহার)। কোনো পরিসেবার প্রয়োজন না থাকলে সেটি বন্ধ করা বাঞ্ছনীয়। এর ফলে, বাগ থেকে উৎপন্ন বিপদের আশঙ্কা হ্রাস করা যাবে।
nl: Het handhaven van de veiligheid op je systeem is heel belangrijk, en een manier voor deze taak is om de toegang tot systeem voorzieningen zorgvuldig te beheren. Je systeem kan het nodig hebben om ongehinderde toegang te hebben tot bepaalde voorzieningen (bijvoorbeeld, <command>httpd</command> als je een Web server hebt draaien). Als je een voorziening echter niet hoeft te verlenen, moet je het uitzetten om je zo weinig mogelijk bloot te stellen aan mogelijke bug exploitaties.

source: There are several different methods for managing access to system services. Choose which method of management to use based on the service, your system's configuration, and your level of Linux expertise.
bn_in: সিস্টেমের পরিসেবাগুলি ব্যবহারের অধিকার নিয়ন্ত্রণের বিভিন্ন পদ্ধতি উপস্থিত রয়েছে। প্রযোজ্য পরিসেবা, আপনার কম্পিউটারের কনফিগারেশন ও আপনার Linux ব্যবহারের পারদর্শিতা অনুযায়ী প্রয়োজনীয় পরিচালন পদ্ধতি নির্বাচন করুন।
nl: Er zijn een aantal verschillende manieren om de toegang tot systeem voorzieningen te beheren. Kies de te gebruiken beheersmethode afhankelijk van de voorziening, de configuratie van je systeem, en je nivo van Linux kennis.

source: The easiest way to deny access to a service is to turn it off. Both the services managed by <command>xinetd</command> and the services in the <filename>/etc/rc.d/init.d</filename> hierarchy (also known as SysV services) can be configured to start or stop with the <application>Services Configuration Tool</application>.
bn_in: কোনো পরিসেবা ব্যবহার প্রতিরোধ করার সবচেয়ে সহজ উপায় হল সেটিকে বন্ধ করে দেওয়া। <command>xinetd</command> দ্বারা পরিচালিত পরিসেবা ও <filename>/etc/rc.d/init.d</filename> অনুক্রমের পরিসেবাগুলি (SysV পরিসেবা নামে পরিচিত) <application>পরিসেবা কনফিগারেশন ব্যবস্থা</application> সহয়োগে আরম্ভ অথবা বন্ধ করা যাবে।
nl: De gemakkelijkste manier om toegang tot een voorziening te verbieden is om hem uit te zetten. Zowel de voorzieningen beheert door <command>xinetd</command> als de voorzieningen in de <filename>/etc/rc.d/init.d</filename> hierarchie (ook bekend als SysV voorzieningen) kunnen geconfigureerd worden om te starten of stoppen met het <application>Voorzieningen configuratie gereedschap</application>.

source: Services Configuration Tool
bn_in: পরিসেবা কনফিগারেশন ব্যবস্থা
nl: Voorzieningen configuratie gereedschap

source: You must be running the <application>X</application> Window System and have root privileges to use the Services Configuration Tool. To start the application on the desktop, go to <menuchoice><guimenu>the main menu on the panel (the menu with the "f" icon)</guimenu><guisubmenu>System</guisubmenu><guisubmenu>Administration</guisubmenu><guimenuitem>Services</guimenuitem></menuchoice>.
bn_in: পরিসেবা কনফিগারেশন ব্যবস্থা ব্যবহারের জন্য চলমান <application>X</application> Window System ও root ব্যবহারকারীর অধিকার উপস্থিত থাকা আবশ্যক। ডেস্কটপ থেকে অ্যাপ্লিকেশনটি আরম্ভ করার জন্য <menuchoice><guimenu>প্যানেলে উপস্থিত প্রধান মেনু ("f" অক্ষর বিশিষ্ট আইকন সহ মেনু) থেকে</guimenu><guisubmenu>সিস্টেম</guisubmenu><guisubmenu>প্রশাসনিক কর্ম</guisubmenu><guimenuitem>পরিসেবা</guimenuitem></menuchoice> নির্বাচন করুন।
nl: Je moet het <application>X</application> Window systeem draaiende hebben en je moet root rechten hebben om het Voorzieningen configuratie gereedschap te gebruiken. Om de toepassing op de desktop te starten, gan je naar <menuchoice><guimenu>het hoofd menu op het paneel (het menu met het "f" icoon)</guimenu><guisubmenu>Systeem</guisubmenu><guisubmenu>Beheer</guisubmenu><guimenuitem>Voorzieningen</guimenuitem></menuchoice>.

source: The <application>Services Configuration Tool</application> is a graphical application to configure which SysV services in the <filename>/etc/rc.d/init.d</filename> directory are started at boot time (for runlevels 3, 4, and 5) and which <command>xinetd</command> services are enabled. It also allows you to start, stop, and restart SysV services.
bn_in: সিস্টেম বুট করার সময় (runlevel ৩, ৪, ও ৫-র জন্য) <filename>/etc/rc.d/init.d</filename> ডিরেক্টরির মধ্যে উপস্থিত কোনো SysV পরিসেবাগুলি ও <command>xinetd</command> পরিসেবাগুলি আরম্ভ করা হবে তা <application>পরিসেবা কনফিগারেশন ব্যবস্থা</application> সহযোগে চিহ্নিত করা যাবে। এটি একটি গ্রাফিক্যাল অ্যাপ্লিকেশন। এই অ্যাপ্লিকেশনের সাহায্যে আপনি SysV পরিসেবাগুলি আরম্ভ, বন্ধ ও পুনরারম্ভ করতে পারবেন।
nl: Het <application>Voorzieningen configuratie gereedschap</application> is een grafische toepassing om in te stellen welke SysV voorzieningen in de <filename>/etc/rc.d/init.d</filename> map worden gestart tijdens het opstarten van computer (voor runlevels 3, 4 en 5) en welke <command>xinetd</command> voorzieningen worden aangezet. Het staat je ook toe om SysV voorzieningen te starten, te stoppen en te herstarten.

source: Configuring network services
bn_in: নেটওয়ার্ক পরিসেবা কনফিগার করার প্রণালী
nl: Configureren van netwerk voorzieningen

source: The <application>Services Configuration Tool</application> lists the services from the <filename>/etc/rc.d/init.d</filename> directory as well as the services controlled by <command>xinetd</command>. Click on the name of the service from the list on the left-hand side of the application to display a brief description of that service as well as the status of the service. If the service is a SysV service, the status window shows whether the service is currently running.
bn_in: <application>পরিসেবা কনফিগারেশন ব্যবস্থা</application> দ্বারা <filename>/etc/rc.d/init.d</filename> ডিরেক্টরির পরিসেবা ও <command>xinetd</command> দ্বারা নিয়ন্ত্রিত পরিসেবাগুলির তালিকা প্রদর্শন করা হয়। অ্যাপ্লিকেশনের প্রদর্শনক্ষেত্রের বাঁদিকে উপস্থিত তালিকা থেকে কোনো পরিসেবার নামে উপর ক্লিক করা হলে সেটির সংক্ষিপ্ত বিবরণ ও বর্তমান অবস্থা সম্পর্কে তথ্য প্রদর্শন করা হয়। SysV পরিসেবার ক্ষেত্রে, পরিসেবাটি বর্তমানে চলছে কি না তা অবস্থাসূচক উইন্ডোর মধ্যে প্রদর্শন করা হয়।
nl: Het <application>Voorzieningen configuratie gereedschap</application> geeft een lijst van de voorzieningen van zowel de <filename>/etc/rc.d/init.d</filename> map als de voorzieningen gecontroleerd door <command>xinetd</command>. Klik op de naam van de voorziening in de lijst aan de linker kant van de toepassing om een korte beschrijving van de voorziening te laten zien met ook de status van die voorziening. Als de voorziening een SysV voorziening is, zal het statusscherm laten zien of de voorziening op dat moment draait.

source: To start, stop, or restart a service immediately, select the service from the list and click the appropriate button on the toolbar (or choose the action from the <guimenu>Service</guimenu> pulldown menu). If the service is an <command>xinetd</command> service, the action buttons are disabled because they cannot be started or stopped individually.
bn_in: বিনা বিলম্বে কোনো পরিসেবা আরম্ভ, বন্ধ অথবা পুনরারম্ভ করার জন্য তালিকা থেকে পরিসেবাটি নির্বাচন করুন ও টুলবার থেকে প্রযোজ্য বাটন ক্লিক করুন (অথবা <guimenu>পরিসেবা</guimenu> শীর্ষক মেনু থেকে প্রযোজ্য কর্ম নির্বাচন করুন)। <command>xinetd</command> পরিসেবাগুলির স্বতন্ত্রভাবে আরম্ভ ও বন্ধ করা সম্ভব না হওয়ার ফলে, এই পরিসেবাগুলির ক্ষেত্রে কর্ম সঞ্চালনার এই বাটনগুলি নিষ্ক্রিয় অবস্থায় থাকে।
nl: Om een voorziening onmiddelijk te starten, te stoppen of te herstarten, selecteer je de voorziening in de lijst en klik je op de overeenkomstige knop in de gereedschapsbalk (of kies de actie in het <guimenu>Voorziening</guimenu> neerklap menu). Als de voorziening een <command>xinetd</command> voorziening is, zullen de actie knoppen niet actief zijn omdat de voorziening niet individueel gestart of gestopt kan worden.

source: Note
bn_in: উল্লেখ্য
nl: Merk op

source: When you save changes to <command>xinetd</command> services, <command>xinetd</command> is reloaded, and the changes take place immediately. When you save changes to other services, the runlevel is reconfigured, but the changes do not take effect immediately.
bn_in: <command>xinetd</command> পরিসেবাগুলির মধ্যে কোনো পরিবর্তন সংরক্ষণ করা হলে <command>xinetd</command> পুনরায় লোড করা হয় ও পরিবর্তনগুলি তৎক্ষনাৎ প্রয়োগ করা হয়। অন্যান্য পরিসেবায় করা পরিবর্তনগুলি সংরক্ষণ করা হলে, runlevel পুনরায় কনফিগার করা হয় কিন্তু পরিবর্তনগুলি তৎক্ষনাৎ প্রয়োগ করা হয় না।
nl: Als je veranderingen in <command>xinetd</command> voorzieningen opslaat, wordt <command>xinetd</command> opnieuw geladen, en de veranderingen worden onmiddelijk doorgevoerd. Als je veranderingen in andere voorzieningen opslaat, wordt het runlevel opnieuw geconfigureerd, maar krijgen de veranderingen niet meteen effect.

source: To enable a service, select the service in the list and click on one of the <guibutton>Enable</guibutton>, <guibutton>Disable</guibutton> or (to enable a SysV service in other than the default runlevels) <guibutton>Customize</guibutton> buttons in the toolbar or choose the equivalent action from the <guimenu>Service</guimenu> menu. In the case of a SysV service, the runlevel configuration is changed, but the runlevel is not restarted; thus, the changes do not take place immediately.
bn_in: কোনো পরিসেবা সক্রিয় করার জন্য, তালিকা থেকে সেটি নির্বাচন করুন ও টুলবার থেকে <guibutton>সক্রিয়</guibutton>, <guibutton>নিষ্ক্রিয়</guibutton> অথবা (ডিফল্ট runlevel ভিন্ন অন্য কোনো runlevel-এ SysV পরিসেবা আরম্ভের জন্য) <guibutton>স্বনির্ধারিত</guibutton> বাটন টিপুন অথবা <guimenu>পরিসেবা</guimenu> শীর্ষক মেনু থেকে প্রযোজ্য কর্ম বাছাই করুন। SysV পরিসেবার ক্ষেত্রে runlevel-র কনফিগারেশন পরিবর্তন করা হয় কিন্তু runlevel পুনরায় আরম্ভ করা হয় না; এর ফলে পরিবর্তনগুলি তৎক্ষণাৎ প্রয়োগ করা হয় না।
nl: Om een voorziening aan te zetten, kies je de voorziening in de lijst en klik je op een van de <guibutton>Aanzetten</guibutton>, <guibutton>Uitzetten</guibutton> of (om een SysV dienst aan te zetten in een andere dan de standaard runlevels) <guibutton>Aanpassen</guibutton> knoppen in de gereedschapbalk of kies de overeenkomstige actie in het <guimenu>Voorziening</guimenu> menu. In het geval van een SysV voorziening wordt de runlevel configuratie verandererd, maar de runlevel wordt niet opnieuw gestart; dus de veranderingen nemen niet meteen plaats.

source: As an example: If you disable the <command>httpd</command> service, the runlevel configuration changes so that <command>httpd</command> is not started at boot time. However, the current runlevel is not reinitialized, so <command>httpd</command> is still running. Select one of following options at this point:
bn_in: উদাহরণস্বরূপ: <command>httpd</command> পরিসেবাটি নিষ্ক্রিয় করা হলে runlevel-র কনফিগারেশন পরিবর্তন করা হয় ও এর ফলে সিস্টেম বুট করার সময় <command>httpd</command> আরম্ভ করা হয় না। কিন্তু পরিসেবার পরিবর্তনের পরে বর্তমান runlevel পুনরায় আরম্ভ না হওয়ার ফলে <command>httpd</command> সঞ্চালনা অবিঘ্নিত থাকে। এই পরিস্থিতিতে নিম্নলিখিত বিকল্পগুলির মধ্যে একটি নির্বাচন করুন:
nl: Bijvoorbeeld: Als je de <command>httpd</command> voorziening uitzet, verandert de runlevel configuratie zodaning dat <command>httpd</command> niet gestart wordt tijdens het opstarten van de computer. Echter het huidige runlevel is niet opnieuw gezet, dus <command>httpd</command> draait nog steeds. Selecteer nu een van de volgende opties:

source: Stop the <command>httpd</command> service — Stop the service by selecting it from the list and clicking the <guibutton>Stop</guibutton> button. The status of the service will be updated accordingly.
bn_in: <command>httpd</command> পরিসেবা বন্ধ করুন — তালিকা থেকে এই পরিসেবাটি নির্বাচন করুন ও <guibutton>বন্ধ</guibutton> শীর্ষক বাটনটি টিপে এটিকে বন্ধ করুন। এর ফলে পরিসেবার অবস্থা আপডেট করা হবে।
nl: Stop de <command>httpd</command> voorziening — Stop de voorziening door het in de lijst te selecteren en klik op de <guibutton>Stoppen</guibutton> knop. De status van de voorziening zal overeenkomstig aangepast worden.

source: Reinitialize the runlevel — Reinitialize the runlevel by going to a shell prompt and typing the command <command>telinit <replaceable>x</replaceable></command> (where <replaceable>x</replaceable> is the runlevel number; for example, 3.). This option is recommended if you enable or disable multiple services and want to activate the changes immediately.
bn_in: runlevel পুনরারম্ভ — শেল প্রম্পেট প্রবেশ করে <command>telinit <replaceable>x</replaceable></command> (<replaceable>x</replaceable>-র পরিবর্তে runlevel সংখ্যা লিখুন; যেমন, 3।) কমান্ড সহযোগে runlevel-টি পুনরায় আরম্ভ করুন। একাধিক পরিসেবা সক্রিয় অথবা নিষ্ক্রিয় করার পরে পরিবর্তনগুলি অবিলম্বে প্রয়োগ করার জন্য এই বিকল্পটি ব্যবহার করা বাঞ্ছনীয়।
nl: Initialiseer het runlevel opnieuw — Initialiseer het runlevel opnieuw door naar de shell prompt te gaan en het volgende commando in te typen:<command>telinit <replaceable>x</replaceable></command> (waarin <replaceable>x</replaceable> het runlevel nummer is; bij voorbeeld, 3.) Deze optie wordt aanbevolen als je meerdere voorzieningen aanzet of uitzet en je de veranderingen meteen wilt activeren.

source: Do nothing else — You do not have to stop the <command>httpd</command> service. You can wait until the system is rebooted for the service to stop. The next time the system is booted, the runlevel is initialized without the <command>httpd</command> service running.
bn_in: কিছু না করা — <command>httpd</command> বন্ধ করার প্রয়োজন নেই ও সিস্টেমটি পুনরায় আরম্ভের পরে পরিসেবাটি বন্ধ হওয়ার অপেক্ষা করা যেতে পারে। পরবর্তীবার সিস্টেমটি বুট করা হলে, প্রযোজ্য runlevel আরম্ভের সময় <command>httpd</command> পরিসেবা আরম্ভ করা হবে না।
nl: Doe niets extras — Je hoeft de <command>httpd</command> voorziening niet te stoppen. Je kunt wachten totdat het systeen opnieuw opgestart wordt om de voorziening te laten stoppen. De volgende keer dat het systeem opgestart wordt, wordt het runlevel geinitialiseerd waarbij de <command>httpd</command> voorziening niet draait.

source: translator-credits
bn_in: রুণা ভট্টাচার্য্য (runab@redhat.com)
nl: Geert Warrink <geert.warrink@onsnet.nu> 2009.
